ybyllc/STM32_Tea_Lib/2_Control/menu.c
/**
 * @file menu.c
 * @brief 菜单系统核心实现
 * @note 负责子菜单管理和菜单系统的整体逻辑
 */

#include "menu.h"
#include "menu_input.h"
#include "wit_gyro_sdk.h"
#include "icm42670.h"
#include "TOF_VL53L0X.h"
#include "remote_key.h"
#include "motor_tb6612.h"
#include "motor_standard.h"
#include "PWM_standard.h"
#include "servo_pwm.h"
#include "key_pc6.h"
#include "encoder.h"
#include "car_task.h"
#include "oled.h"
#include "ax_ps2.h"
#include "stm32f4xx_hal.h"
#include "stm32f4xx_hal_adc.h"
#include "stm32f4xx_hal_gpio.h"
#include <stdio.h>
#include <stdlib.h>

// 陀螺仪类型枚举
typedef enum {
    GYRO_TYPE_NONE,        // 无陀螺仪
    GYRO_TYPE_WIT,         // 原来的陀螺仪
    GYRO_TYPE_ICM42670     // ICM42670 陀螺仪
} GyroType;

// 模块初始化状态标志
uint8_t gyro_initialized = 0;    // 陀螺仪是否已初始化
uint8_t tof_initialized = 0;     // TOF是否已初始化
uint8_t remote_key_initialized = 0; // 遥控器是否已初始化
uint8_t motor_initialized = 0;   // 电机是否已初始化
uint8_t adc_initialized = 0;     // ADC是否已初始化
uint8_t ps2_initialized = 0;     // PS2手柄是否已初始化
uint8_t gpio_initialized = 0;    // GPIO测试是否已初始化

// ADC句柄
ADC_HandleTypeDef hadc1;

// 电机测试状态
int16_t motor_speeds[4] = {0, 0, 0, 0}; // 四个电机的速度值（-1000到1000）
uint8_t current_motor_index = 0; // 当前选中的电机索引（0-3）
uint8_t motor_speed_adjust_mode = 0; // 速度调整模式：0-选择电机模式，1-调整速度模式

// 系统状态变量
uint8_t system_mode = 0; // 0-菜单模式, 1-任务模式
uint32_t task_start_time = 0; // 任务开始时间

// 编码器累计值
int32_t encoder1_total_count = 0; // 编码器1的累计值
int32_t encoder2_total_count = 0; // 编码器2的累计值

// 当前使用的陀螺仪类型
static GyroType current_gyro_type = GYRO_TYPE_NONE;

// 外部函数声明
extern void Gryo_Update(void);

// 静态函数声明
static void Menu_DisplayGyroPage(void);
static void Menu_DisplayEc11TestPage(void);
static void Menu_DisplayTofTestPage(void);
static void Menu_DisplayRemoteKeyTestPage(void);
static void Menu_DisplayMotorTestPage(void);
static void Menu_DisplayEncoderTestPage(void);
static void Menu_DisplayAdcTestPage(void);
static void Menu_DisplayPS2TestPage(void);
static void Menu_DisplayPS2ControlPage(void);
static void Menu_DisplayGPIOTestPage(void);
static void Menu_DisplayMainMenu(void);
static void Menu_DisplayCurrentPage(void);

/**
 * @brief 绘制摇杆进度条（带中心点）
 * @param x: 起始x坐标
 * @param y: 起始y坐标
 * @param width: 进度条总宽度
 * @param value: 摇杆值 (0-255, 128为中位)
 */
static void DrawStickBar(u8 x, u8 y, u8 width, u8 value) {
    u8 height = 6;  // 进度条高度
    u8 center_x = x + width / 2;  // 中心位置（中位点）
    
    // 绘制外框
    OLED_DrawRectangle(x, y, x + width, y + height, 1);
    
    // 计算填充位置（value: 0-255 -> 0-width）
    // 128为中位，小于128向左填充，大于128向右填充
    if (value > 128) {
        // 向右填充
        u8 fill_width = ((value - 128) * (width / 2)) / 127;
        if (fill_width > 0) {
            OLED_DrawFillRectangle(center_x, y + 1, center_x + fill_width, y + height - 1, 1);
        }
    } else if (value < 128) {
        // 向左填充
        u8 fill_width = ((128 - value) * (width / 2)) / 128;
        if (fill_width > 0) {
            OLED_DrawFillRectangle(center_x - fill_width, y + 1, center_x, y + height - 1, 1);
        }
    }
    
    // 绘制中心线
    OLED_DrawLine(center_x, y, center_x, y + height, 1);
}

/**
 * @brief 初始化ADC（仅在第一次进入ADC页面时调用）
 * @retval 0-失败, 1-成功
 */
uint8_t Menu_InitAdc(void) {
    if (adc_initialized) {
        return 1;  // 已经初始化过
    }
    
    // 启用GPIOC时钟
    __HAL_RCC_GPIOC_CLK_ENABLE();
    
    // 启用ADC1时钟
    __HAL_RCC_ADC1_CLK_ENABLE();
    
    // 配置PC4引脚为ADC输入
    GPIO_InitTypeDef GPIO_InitStruct = {
        .Pin = GPIO_PIN_4,
        .Mode = GPIO_MODE_ANALOG,
        .Pull = GPIO_NOPULL
    };
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
    
    // 配置ADC
    hadc1.Instance = ADC1;
    hadc1.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV4;
    hadc1.Init.Resolution = ADC_RESOLUTION_12B;
    hadc1.Init.ScanConvMode = DISABLE;
    hadc1.Init.ContinuousConvMode = DISABLE;  // 单次转换模式
    hadc1.Init.DiscontinuousConvMode = DISABLE;
    hadc1.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
    hadc1.Init.ExternalTrigConv = ADC_SOFTWARE_START;
    hadc1.Init.DataAlign = ADC_DATAALIGN_RIGHT;
    hadc1.Init.NbrOfConversion = 1;
    hadc1.Init.DMAContinuousRequests = DISABLE;
    hadc1.Init.EOCSelection = ADC_EOC_SINGLE_CONV;
    
    if (HAL_ADC_Init(&hadc1) != HAL_OK) {
        return 0;  // 初始化失败
    }
    
    // 配置ADC通道
    ADC_ChannelConfTypeDef sConfig = {
        .Channel = ADC_CHANNEL_14,  // PC4对应ADC1通道14
        .Rank = 1,
        .SamplingTime = ADC_SAMPLETIME_480CYCLES  // 使用较长的采样时间
    };
    
    if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK) {
        return 0;  // 通道配置失败
    }
    
    adc_initialized = 1;
    return 1;
}

/**
 * @brief 初始化PS2手柄（仅在第一次进入PS2页面时调用）
 * @retval 0-失败, 1-成功
 */
uint8_t Menu_InitPS2(void) {
    if (ps2_initialized) {
        return 1;  // 已经初始化过
    }
    
    // 初始化PS2手柄
    AX_PS2_Init();
    AX_PS2_SetInit();
    
    ps2_initialized = 1;
    return 1;
}

/**
 * @brief 初始化陀螺仪（仅在第一次进入Gyro页面时调用）
 * @retval 0-失败, 1-成功
 */
uint8_t Menu_InitGyro(void) {
    if (gyro_initialized) {
        return 1;  // 已经初始化过
    }
    
    // 尝试初始化 ICM42670
    if (ICM42670_Init()) {
        current_gyro_type = GYRO_TYPE_ICM42670;
        gyro_initialized = 1;
        return 1;
    }
    
    // 如果 ICM42670 失败，尝试初始化串口陀螺仪（WIT）
    Gryo_init();  // 串口陀螺仪初始化
    current_gyro_type = GYRO_TYPE_WIT;
    gyro_initialized = 1;
    return 1;
}

/**
 * @brief 初始化TOF（仅在第一次进入TOF页面时调用）
 * @retval 0-失败, 1-成功
 */
uint8_t Menu_InitTof(void) {
    if (tof_initialized) {
        return 1;  // 已经初始化过
    }
    
    if (VL53L0X_Init() == 0) {
        tof_initialized = 1;
        return 1;
    }
    
    return 0;  // 初始化失败
}

/**
 * @brief 初始化遥控器（仅在第一次进入Remote Key页面时调用）
 * @retval 0-失败, 1-成功
 */
uint8_t Menu_InitRemoteKey(void) {
    if (remote_key_initialized) {
        return 1;  // 已经初始化过
    }
    
    RemoteKey_Init();
    remote_key_initialized = 1;
    return 1;
}

/**
 * @brief 初始化电机（仅在第一次进入Motor Test页面时调用）
 * @retval 0-失败, 1-成功
 */
uint8_t Menu_InitMotor(void) {
    if (motor_initialized) {
        return 1;  // 已经初始化过
    }
    
    Motor_Init();
    motor_initialized = 1;
    return 1;
}

/**
 * @brief  通用陀螺仪更新函数，根据当前使用的陀螺仪类型调用对应的更新函数
 * @param  无
 * @retval 无
 */
void Menu_Gryo_Update(void) {
    switch (current_gyro_type) {
        case GYRO_TYPE_ICM42670:
            // 使用 ICM42670 陀螺仪
            ICM42670_Gryo_Update();
            break;
        case GYRO_TYPE_WIT:
            // 使用原来的陀螺仪
            Gryo_Update();
            break;
        case GYRO_TYPE_NONE:
        default:
            // 无陀螺仪，不做任何操作
            break;
    }
}

// 主菜单项目定义
const MenuItem mainMenuItems[] = {
    {"Gyro Info", MENU_PAGE_GYRO},
    {"EC11 Test", MENU_PAGE_EC11_TEST},
    {"TOF Test", MENU_PAGE_TOF_TEST},
    {"Remote Key Test", MENU_PAGE_REMOTE_KEY_TEST},
    {"Motor Test", MENU_PAGE_MOTOR_TEST},
    {"Encoder Test", MENU_PAGE_ENCODER_TEST},
    {"ADC Test", MENU_PAGE_ADC_TEST},
    {"PS2 Test", MENU_PAGE_PS2_TEST},
    {"PS2 Control", MENU_PAGE_PS2_CONTROL},
    {"GPIO Test", MENU_PAGE_GPIO_TEST}
};

// 主菜单项目数量
uint8_t MAIN_MENU_ITEM_COUNT = (sizeof(mainMenuItems) / sizeof(MenuItem));

// 菜单状态
MenuState menuState;

/**
 * @brief 菜单系统初始化
 */
void Menu_Init(void) {
    menuState.currentPage = MENU_PAGE_MAIN;
    menuState.currentItem = 0;
    menuState.lastEncoderCount = 0;
    menuState.isInMenu = 1;
    
    // 初始化OLED
    OLED_Init();
    OLED_Clear(0);
    
    // 初始化输入处理
    MenuInput_Init();
    
    // 显示初始页面
    Menu_DisplayMainMenu();
}

/**
 * @brief 主任务函数
 * @note 启动car_task，让陀螺仪z轴保持在30度来笔直前进
 */
static void Menu_RunMainTask(void) {
    OLED_Clear(0);
    
    // 在屏幕中间显示反色的 "Task Start"
    OLED_ShowString_Reverse(40, 3, "Task Start", 16);
    
    OLED_Refresh();
    
