ybyllc/STM32_Tea_Lib/2_Control/menu.c
    // 初始化car_task
    Car_Task_Init();
    
    // 启动car_task
    Car_Task_Start();
    
    // 记录任务开始时间
    task_start_time = HAL_GetTick();
    
    // 切换到任务模式
    system_mode = 1;
}

/**
 * @brief 菜单系统运行
 * @note 在主循环中调用
 */
void Menu_Run(void) {
    // 初始化PC6按键
    static uint8_t key_pc6_initialized = 0;
    if (!key_pc6_initialized) {
        KeyPC6_Init();
        key_pc6_initialized = 1;
    }
    
    // 检测PC6按键事件
    uint8_t key_pc6_event = KeyPC6_CheckEvent();
    if (key_pc6_event != 0) {
        if (key_pc6_event == 1) {
            if (system_mode == 0) {
                // 短按：启动主任务
                Menu_RunMainTask();
            } else {
                // 任务模式下短按：停止主任务
                Car_Task_Stop();
                system_mode = 0;
                OLED_Clear(0);
                OLED_ShowString(40, 3, "Task Stop", 16);
                OLED_Refresh();
                HAL_Delay(1000);
                OLED_Clear(0);
            }
        } else if (key_pc6_event == 2) {
            // 长按：系统重启
            HAL_NVIC_SystemReset();
        }
    }
    
    // 检查任务模式
    if (system_mode == 1) {
        // 执行car_task主函数
        Car_Task_Main();
        
        // 短暂延迟，避免执行过快
        HAL_Delay(5);
        
        return; // 任务模式下不执行菜单操作
    }
    
    // 获取编码器计数
    int32_t encoderCount = MenuInput_GetEncoderCount();
    
    // 处理编码器输入
    if (encoderCount != menuState.lastEncoderCount) {
        MenuInput_HandleEncoder(encoderCount);
        menuState.lastEncoderCount = encoderCount;
    }
    
    // 获取按键事件
    uint8_t keyEvent = MenuInput_GetEncoderKeyEvent();
    if (keyEvent != 0) {
        MenuInput_HandleKeyEvent(keyEvent);
    }
    
    // 扫描遥控器按键状态
    MenuInput_ScanRemoteKey();
    
    // 显示当前页面
    Menu_DisplayCurrentPage();
    
    // 短暂延迟，避免显示刷新过快
    HAL_Delay(5);
}

/**
 * @brief 获取当前菜单状态
 * @return 菜单状态指针
 */
MenuState* Menu_GetState(void) {
    return &menuState;
}

/**
 * @brief 添加新的子菜单
 * @param name 菜单项名称
 * @param page 菜单项对应的页面
 * @return 0-失败, 1-成功
 * @note 此函数需要在 Menu_Init() 之前调用
 */
uint8_t Menu_AddItem(const char* name, MenuPageType page) {
    // 注意：此函数目前仅作为接口，实际添加子菜单需要修改 mainMenuItems 数组
    // 后续可以实现动态添加子菜单的功能
    printf("Menu_AddItem: %s, page: %d\r\n", name, page);
    return 1;
}

/**
 * @brief 获取主菜单项数量
 * @return 主菜单项数量
 */
uint8_t Menu_GetMainItemCount(void) {
    return MAIN_MENU_ITEM_COUNT;
}

/**
 * @brief 获取主菜单项
 * @param index 菜单项索引
 * @return 菜单项指针
 */
const MenuItem* Menu_GetMainItem(uint8_t index) {
    if (index < MAIN_MENU_ITEM_COUNT) {
        return &mainMenuItems[index];
    }
    return NULL;
}

/**
 * @brief 显示陀螺仪信息页面
 */
static void Menu_DisplayGyroPage(void) {
    OLED_Clear(0);
    
    // 首次进入时初始化陀螺仪
    if (!gyro_initialized) {
        Menu_InitGyro();
    }
    
    // 更新陀螺仪数据
    Menu_Gryo_Update();
    
    char str[20];
    char str1[20];
    
    // 改为竖排，与原来的显示样式一致
    sprintf(str, "servo:");
    OLED_ShowString(0, 0, str, 16);
    sprintf(str1, "%.1f", fYaw);
    OLED_ShowString_Reverse(strlen(str)*8, 0, str1, 16);
    
    sprintf(str, "x:%.1f", fAngle[0]);
    OLED_ShowString(0, 2, str, 16);
    sprintf(str, "y:%.1f", fAngle[1]);
    OLED_ShowString(0, 4, str, 16);
    sprintf(str, "z:%.1f", fAngle[2]);
    OLED_ShowString(0, 6, str, 16);

    sprintf(str, " x:%.1f", fAcc[0]*10);
    OLED_ShowString(63, 2, str, 16);
    sprintf(str, " y:%.1f", fAcc[1]*10);
    OLED_ShowString(63, 4, str, 16);
    sprintf(str, " z:%.1f", fAcc[2]*10);
    OLED_ShowString(63, 6, str, 16);
    
    // 舵机控制 - 每次最多移动0.5度，2度死区
    extern float servo_current_angle;
    extern float servo_target_angle;
    float target_angle = servo_current_angle + fAngle[1];
    servo_target_angle = target_angle;
    
    sprintf(str1, "%.1f", target_angle);
    OLED_ShowString_Reverse(strlen(str)*8, 0, str1, 16);
    
    OLED_Refresh();
}

/**
 * @brief 显示EC11测试页面
 */
static void Menu_DisplayEc11TestPage(void) {
    OLED_Clear(0);
    
    // 显示标题
    OLED_ShowString(0, 0, "EC11 Test", 16);
    
    // 初始化PC6按键
    static uint8_t key_pc6_initialized = 0;
    if (!key_pc6_initialized) {
        KeyPC6_Init();
        key_pc6_initialized = 1;
    }
    
    // 获取当前计数
    int32_t currentCount = MenuInput_GetEncoderCount();
    
    // 显示计数值
    char str[20];
    sprintf(str, "Count:%4d", currentCount);
    OLED_ShowString(0, 2, str, 16);
    
    // 显示编码器按键状态
    char str1[20];
    sprintf(str1, "EncKey:%s", MenuInput_GetEncoderKeyState() ? "R" : "P");
    OLED_ShowString(0, 4, str1, 12);
    
    // 显示PC6按键状态
    sprintf(str1, "PC6Key:%s", KeyPC6_GetState() ? "R" : "P");
    OLED_ShowString(0, 5, str1, 12);
    
    // 显示提示信息
    OLED_ShowString(0, 7, "Turn & Press!", 12);
    
    OLED_Refresh();
}

/**
 * @brief 显示TOF测试页面
 */
static void Menu_DisplayTofTestPage(void) {
    OLED_Clear(0);
    
    // 显示标题
    OLED_ShowString(0, 0, "TOF Test", 16);
    
    // 首次进入时初始化TOF
    if (!tof_initialized) {
        Menu_InitTof();
    }
    
    // 读取距离（使用快速测试函数）
    u16 distance_mm = TOF_QuickTest();
    
    // 显示距离值
    char str[20];
    if (distance_mm == 0xFFFF) {
        sprintf(str, "Dist: Error");
    } else if (distance_mm <= 44) {
        // 低于 44mm，显示超出范围
        sprintf(str, "Dist: <4.4cm");
    } else if (distance_mm >= 8190) {
        // 高于 8190mm，显示超出范围
        sprintf(str, "Dist: >120cm");
    } else {
        // 正常范围，转换为 cm 显示
        float distance_cm = distance_mm / 10.0f;
        sprintf(str, "Dist:%5.1f cm", distance_cm);
    }
    OLED_ShowString(0, 2, str, 16);
    
    // 显示状态
    u8 ready = VL53L0X_IsReady();
    sprintf(str, "Status:%s", ready ? "OK" : "ERR");
    OLED_ShowString(0, 4, str, 16);
    
    // 显示提示
    OLED_ShowString(0, 6, "Long press back", 12);
    
    OLED_Refresh();
}

/**
 * @brief 显示遥控器测试页面
 */
static void Menu_DisplayRemoteKeyTestPage(void) {
    OLED_Clear(0);
    
    // 显示标题
    OLED_ShowString(0, 0, "Remote Key Test", 16);
    
    // 首次进入时初始化遥控器
    if (!remote_key_initialized) {
        Menu_InitRemoteKey();
    }
    
    // 显示按键状态
    char str[20];
    for (uint8_t i = 0; i < REMOTE_KEY_MAX; i++) {
        uint8_t state = RemoteKey_GetState((RemoteKeyType)i);
        RemoteKeyEventType event = RemoteKey_GetEvent((RemoteKeyType)i);
        
        switch (i) {
            case REMOTE_KEY_D0:
                sprintf(str, "D0:%s", state ? "P" : "R");
                break;
            case REMOTE_KEY_D1:
                sprintf(str, "D1:%s", state ? "P" : "R");
                break;
            case REMOTE_KEY_D2:
                sprintf(str, "D2:%s", state ? "P" : "R");
                break;
            case REMOTE_KEY_D3:
                sprintf(str, "D3:%s", state ? "P" : "R");
                break;
            default:
                sprintf(str, "Unknown");
                break;
        }
        
        // 显示事件信息
        if (event != REMOTE_KEY_EVENT_NONE) {
            char event_str[10];
            switch (event) {
                case REMOTE_KEY_EVENT_SINGLE_CLICK:
                    sprintf(event_str, "S");
                    break;
                case REMOTE_KEY_EVENT_LONG_PRESS:
                    sprintf(event_str, "L");
                    break;
                case REMOTE_KEY_EVENT_LONG_PRESS_RELEASE:
                    sprintf(event_str, "LR");
                    break;
                default:
                    sprintf(event_str, "N");
                    break;
            }
            sprintf(str + strlen(str), " %s", event_str);
        }
        
        OLED_ShowString(0, (i + 1), str, 12);
    }
    
