ybyllc/STM32_Tea_Lib/2_Control/menu.c
    // 如果当前不是 PS2_CONTROL 页面，直接返回
    if (menuState.currentPage != MENU_PAGE_PS2_CONTROL) {
        return;
    }
    
    OLED_Clear(0);
    
    // 首次进入时初始化PS2和舵机PWM
    if (!ps2_initialized) {
        Menu_InitPS2();
    }
    if (!servo_initialized) {
        Servo_Pwm_Init();
        servo_initialized = 1;
    }
    
    // 读取PS2数据
    AX_PS2_ScanKey(&ps2_joystick);
    
    // 摇杆值(0-255)转换为PWM脉宽(1000-2000us)，128为中位
    // 公式: pulse = 1500 + (stick - 128) * 500 / 127
    // 左摇杆Y -> B1
    uint16_t left_y_pwm = 1500 + (int16_t)(ps2_joystick.LJoy_UD - 128) * 500 / 127;
    // 左摇杆X -> B0
    uint16_t left_x_pwm = 1500 + (int16_t)(ps2_joystick.LJoy_LR - 128) * 500 / 127;
    // 右摇杆Y -> A7
    uint16_t right_y_pwm = 1500 + (int16_t)(ps2_joystick.RJoy_UD - 128) * 500 / 127;
    // 右摇杆X -> A6
    uint16_t right_x_pwm = 1500 + (int16_t)(ps2_joystick.RJoy_LR - 128) * 500 / 127;
    
    // 设置死区，避免摇杆中位时的抖动
    #define PWM_DEADZONE 30
    if (abs((int16_t)left_y_pwm - 1500) < PWM_DEADZONE) left_y_pwm = 1500;
    if (abs((int16_t)left_x_pwm - 1500) < PWM_DEADZONE) left_x_pwm = 1500;
    if (abs((int16_t)right_y_pwm - 1500) < PWM_DEADZONE) right_y_pwm = 1500;
    if (abs((int16_t)right_x_pwm - 1500) < PWM_DEADZONE) right_x_pwm = 1500;
    
    // 设置PWM输出
    Servo_Pwm_SetPulse(SERVO_PWM_CH_B1, left_y_pwm);
    Servo_Pwm_SetPulse(SERVO_PWM_CH_B0, left_x_pwm);
    Servo_Pwm_SetPulse(SERVO_PWM_CH_A7, right_y_pwm);
    Servo_Pwm_SetPulse(SERVO_PWM_CH_A6, right_x_pwm);
    
    // 使用16号字体，每行占2个page（16像素高度）
    // 第0-1行：LX（左摇杆X轴）
    OLED_ShowString(0, 0, "LX:", 16);
    DrawStickBar(28, 0, 100, ps2_joystick.LJoy_LR);
    
    // 第2-3行：LY（左摇杆Y轴）
    OLED_ShowString(0, 2, "LY:", 16);
    DrawStickBar(28, 16, 100, ps2_joystick.LJoy_UD);
    
    // 第4-5行：RX（右摇杆X轴）
    OLED_ShowString(0, 4, "RX:", 16);
    DrawStickBar(28, 32, 100, ps2_joystick.RJoy_LR);
    
    // 第6-7行：RY（右摇杆Y轴）
    OLED_ShowString(0, 6, "RY:", 16);
    DrawStickBar(28, 48, 100, ps2_joystick.RJoy_UD);
    
    OLED_Refresh();
}

// GPIO测试引脚状态（用函数调用次数计数）
static uint8_t gpio_cycle_counter[4] = {0, 0, 0, 0};    // 周期计数器（0-9）

// 每个引脚在10次函数调用中的高电平次数
static const uint8_t gpio_pin_high_times[4] = {1, 2, 3, 4};
#define GPIO_CYCLE_MAX  10  // 10次函数调用为一个周期

/**
 * @brief 初始化GPIO测试引脚（PC0-PC3）
 */
static void Menu_InitGPIOTest(void) {
    if (gpio_initialized) return;
    
    GPIO_InitTypeDef GPIO_InitStruct = {0};
    
    // 启用GPIOC时钟
    __HAL_RCC_GPIOC_CLK_ENABLE();
    
    // 配置PC0-PC3为推挽输出
    GPIO_InitStruct.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
    
    // 初始状态为低电平
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3, GPIO_PIN_RESET);
    
    // 初始化计数器
    for (int i = 0; i < 4; i++) {
        gpio_cycle_counter[i] = 0;
    }
    
    gpio_initialized = 1;
}

/**
 * @brief 显示GPIO测试页面
 * @note 测试PC0-PC3引脚，10次函数调用一个周期，不同引脚不同高电平次数
 */
static void Menu_DisplayGPIOTestPage(void) {
    static MenuPageType last_page = MENU_PAGE_MAIN;
    
    // 检测页面切换（从 GPIO_TEST 切换到其他页面）
    if (last_page == MENU_PAGE_GPIO_TEST && menuState.currentPage != MENU_PAGE_GPIO_TEST) {
        // 停止 PWM，将引脚设为高电平（PS2通信默认状态）
        HAL_GPIO_WritePin(GPIOC, GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3, GPIO_PIN_SET);
        gpio_initialized = 0;
    }
    last_page = menuState.currentPage;
    
    // 如果当前不是 GPIO_TEST 页面，直接返回
    if (menuState.currentPage != MENU_PAGE_GPIO_TEST) {
        return;
    }
    
    // 初始化GPIO（首次进入）
    if (!gpio_initialized) {
        Menu_InitGPIOTest();
    }
    
    // 先更新GPIO输出
    uint16_t pins[4] = {GPIO_PIN_0, GPIO_PIN_1, GPIO_PIN_2, GPIO_PIN_3};
    
    for (int i = 0; i < 4; i++) {
        // 根据计数器决定输出：计数器小于高电平次数则为高，否则为低
        if (gpio_cycle_counter[i] < gpio_pin_high_times[i]) {
            HAL_GPIO_WritePin(GPIOC, pins[i], GPIO_PIN_SET);
        } else {
            HAL_GPIO_WritePin(GPIOC, pins[i], GPIO_PIN_RESET);
        }
        
        // 计数器递增
        gpio_cycle_counter[i]++;
        if (gpio_cycle_counter[i] >= GPIO_CYCLE_MAX) {
            gpio_cycle_counter[i] = 0;
        }
    }
    
    // 显示界面
    OLED_Clear(0);
    
    // 显示标题
    OLED_ShowString(0, 0, "GPIO Test", 16);
    
    // 显示引脚信息
    OLED_ShowString(0, 16, "10 cycles PWM", 12);
    
    // 显示各引脚高电平次数
    char str[30];
    sprintf(str, "P0:%d P1:%d P2:%d P3:%d", 
            gpio_pin_high_times[0], gpio_pin_high_times[1], 
            gpio_pin_high_times[2], gpio_pin_high_times[3]);
    OLED_ShowString(0, 28, str, 12);
    
    // 显示当前计数器
    sprintf(str, "C0:%d C1:%d C2:%d C3:%d", 
            gpio_cycle_counter[0], gpio_cycle_counter[1],
            gpio_cycle_counter[2], gpio_cycle_counter[3]);
    OLED_ShowString(0, 40, str, 12);
    
    // 显示提示
    OLED_ShowString(0, 52, "Auto running...", 12);
    OLED_ShowString(0, 64, "Long press to exit", 12);
    
    OLED_Refresh();
}

/**
 * @brief 显示主菜单
 * @note 原来的样式，垂直列表布局，支持滚动
 */
static void Menu_DisplayMainMenu(void) {
    OLED_Clear(0);
    
    // 垂直行布局参数
    #define MAX_VISIBLE_ITEMS 4  // 16字大小对应4行
    
    // 计算滚动偏移量
    uint8_t scroll_offset = 0;
    if (menuState.currentItem >= MAX_VISIBLE_ITEMS) {
        scroll_offset = menuState.currentItem - MAX_VISIBLE_ITEMS + 1;
    }
    
    // 垂直行布局，每个菜单项占一行，16字大小
    for (uint8_t i = 0; i < MAIN_MENU_ITEM_COUNT; i++) {
        // 只显示在可见范围内的菜单项
        if (i >= scroll_offset && i < scroll_offset + MAX_VISIBLE_ITEMS) {
            uint8_t display_row = i - scroll_offset;
            if (i == menuState.currentItem) {
                // 显示选中的菜单项（带方框标记）
                OLED_ShowString(0, display_row * 2, "[", 16);
                OLED_ShowString(12, display_row * 2, mainMenuItems[i].name, 16);
                OLED_ShowString(112, display_row * 2, "]", 16);
            } else {
                // 显示未选中的菜单项
                OLED_ShowString(12, display_row * 2, mainMenuItems[i].name, 16);
            }
        }
    }
    
    OLED_Refresh();
}

/**
 * @brief 显示当前页面
 */
static void Menu_DisplayCurrentPage(void) {
    switch (menuState.currentPage) {
        case MENU_PAGE_MAIN:
            Menu_DisplayMainMenu();
            break;
        case MENU_PAGE_GYRO:
            Menu_DisplayGyroPage();
            break;
        case MENU_PAGE_EC11_TEST:
            Menu_DisplayEc11TestPage();
            break;
        case MENU_PAGE_TOF_TEST:
            Menu_DisplayTofTestPage();
            break;
        case MENU_PAGE_REMOTE_KEY_TEST:
            Menu_DisplayRemoteKeyTestPage();
            break;
        case MENU_PAGE_MOTOR_TEST:
            Menu_DisplayMotorTestPage();
            break;
        case MENU_PAGE_ENCODER_TEST:
            Menu_DisplayEncoderTestPage();
            break;
        case MENU_PAGE_ADC_TEST:
            Menu_DisplayAdcTestPage();
            break;
        case MENU_PAGE_PS2_TEST:
            Menu_DisplayPS2TestPage();
            break;
        case MENU_PAGE_PS2_CONTROL:
            Menu_DisplayPS2ControlPage();
            break;
        case MENU_PAGE_GPIO_TEST:
            Menu_DisplayGPIOTestPage();
            break;
        default:
            Menu_DisplayMainMenu();
            break;
    }
}
